# SetLossFactor Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LightType..::..SetLossFactor Method
LightType Class See Also
---
Replace the current loss factor object with the given object
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetLossFactor(
	LossFactor lossFactor
)
```

Visual Basic
---
```text
Public Sub SetLossFactor ( _
	lossFactor As LossFactor _
)
```

Visual C++
---
```text
public:
void SetLossFactor(
	LossFactor^ lossFactor
)
```

# ### Parameters
lossFactor
    Type: Autodesk.Revit.DB.Lighting..::..LossFactor An object derived from a LossFactor object
# Remarks
The argument object is cloned
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
LightType Class
Autodesk.Revit.DB.Lighting Namespace